Обработки/Reports/_НепогашенныеЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_НепогашенныеЗадолженности</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсключаемыеСчета</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_НепогашенныеЗадолженности/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Непогашенные задолженности",
		"1.11",
		"",
		Истина
	);
		
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "ОтправкаОповещенийОНепогашенныхЗадолженностях", 				"Отправка оповещений о не погашенных в срок задолженностях", 						, Ложь, "ВызовСерверногоМетода");
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "ОтправкаОповещенийОНепогашенныхЗадолженностяхКонтролерам", 	"Отправка оповещений контролерам о не погашенных в срок задолженностях", 			, Ложь, "ВызовСерверногоМетода");
	
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции

// Интерфейс для запуска формирования отчетов по регламентному заданию
//
// Параметры:
//     ИдентификаторКоманды (строка)  - идентификатор команды
//     ПараметрыОбработки (структура) - структура со свойством ДополнительнаяОбработкаСсылка (ссылка на
//        элемент справочника ДополнительныеОтчетыИОбработки, который связан с данной дополнительной обработкой)
//
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт
	
	ТекущаяДата = ТекущаяДата();
	
	Если ИдентификаторКоманды = "ОтправкаОповещенийОНепогашенныхЗадолженностях" Тогда
		
		// Только по рабочим дням
	
		Если Не Справочники.Календари.ЭтоРабочийДень(Справочники.Календари.Общероссийский, ТекущаяДата) Тогда
			Возврат;	
		КонецЕсли;
		
		ЭтотОбъект.Период = ТекущаяДата;
		
	ИначеЕсли ИдентификаторКоманды = "ОтправкаОповещенийОНепогашенныхЗадолженностяхКонтролерам" Тогда
		
		// На 9-й рабочий день от конца месяца
		
		КонецПредыдущегоМесяца = НачалоМесяца(ТекущаяДата) - 1;
		
		Если Не Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, КонецПредыдущегоМесяца, 9) = НачалоДня(ТекущаяДата) Тогда
			Возврат;	
		КонецЕсли;
		
		ЭтотОбъект.Период = КонецПредыдущегоМесяца;
		
	ИначеЕсли ИдентификаторКоманды = "ОтправкаОповещенийОНесписанныхРезервахПоВыбывшимАктивам" Тогда
		
		// Только по рабочим дням
	
		Если Не Справочники.Календари.ЭтоРабочийДень(Справочники.Календари.Общероссийский, ТекущаяДата) Тогда
			Возврат;	
		КонецЕсли;
			
		ЭтотОбъект.Период = Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, ТекущаяДата, -2);
		
	Иначе
		
		ВызватьИсключение СтрШаблон("Неизвестный идентификатор команды '%1'", ИдентификаторКоманды);
		
	КонецЕсли; 
	
	ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(ПараметрыОбработки.ДополнительнаяОбработкаСсылка, ИдентификаторКоманды, ПараметрыОбработки.ГруппаПараметров);
	
	ЭтотОбъект.Организация = ПараметрыКоманды.Организация;
	
	Если ИдентификаторКоманды = "ОтправкаОповещенийОНесписанныхРезервахПоВыбывшимАктивам" Тогда
		ОтправкаОповещенийОНесписанныхРезервахПоВыбывшимАктивам(ИдентификаторКоманды);
	Иначе
		ОтправкаОповещенийОНепогашенныхЗадолженностях(ИдентификаторКоманды);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтправкаОповещенийОНесписанныхРезервахПоВыбывшимАктивам(ИдентификаторКоманды)
	
	// Фиксация начала выполнения команды 	
	Механизм			= ЭтотОбъект.Метаданные().ПолноеИмя() + "." + ИдентификаторКоманды + "()";
	ПараметрыСтатистики	= РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект);	
	Сессия				= РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(Механизм, ПараметрыСтатистики.Хранилище, ПараметрыСтатистики.Описание); 
	
	// Формирование	
	НесписанныеРезервы = ЗапросНесписанныхРезервовПодОбесценение();
	
	Если Не НесписанныеРезервы.Пустой() Тогда 
		
		ДокументРезультат = Новый ТабличныйДокумент;
		
		СформироватьОтчетПоРезервам(ДокументРезультат, НесписанныеРезервы);

		ПодготовитьОповещение(ДокументРезультат, Механизм);
			
	КонецЕсли;
	
	// Фиксация завершения формирования отчета	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры

Процедура ОтправкаОповещенийОНепогашенныхЗадолженностях(ИдентификаторКоманды)
	
	ЭтотОбъект.ЗаполнитьИсключаемыеСчета();
	
	// Фиксация начала выполнения команды 
	
	Механизм			= ЭтотОбъект.Метаданные().ПолноеИмя() + "." + ИдентификаторКоманды + "()";
	ПараметрыСтатистики	= РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект);	
	Сессия				= РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(Механизм, ПараметрыСтатистики.Хранилище, ПараметрыСтатистики.Описание); 
	
	// Формирование
	
	НепогашенныеЗадолженности = ЗапросНепогашенныхЗадолженностей();
	
	Если Не НепогашенныеЗадолженности.Пустой() Тогда 
		
		ДокументРезультат = Новый ТабличныйДокумент;
		
		СформироватьОтчетПоЗадолженности(ДокументРезультат, НепогашенныеЗадолженности);

		ПодготовитьОповещение(ДокументРезультат, Механизм);
			
	КонецЕсли;
	
	// Фиксация завершения формирования отчета
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);	
	
КонецПроцедуры

Процедура ПодготовитьОповещение(ДокументРезультат, Механизм) 
	
	ИмяФайла = ПолучитьИмяВременногоФайла("htm");
	ДокументРезультат.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.HTML);

	ТелоПисьма = Новый ТекстовыйДокумент;
	ТелоПисьма.Прочитать(ИмяФайла);

	УдалитьФайлы(ИмяФайла);

	РеквизитыОповещения = Новый Структура;
	РеквизитыОповещения.Вставить("Организация",	Организация);
	РеквизитыОповещения.Вставить("Дата",		НачалоДня(ЭтотОбъект.Период));
	РеквизитыОповещения.Вставить("ДатаСтрокой",	Формат(ЭтотОбъект.Период, "ДФ=dd.MM.yyyy"));
	РеквизитыОповещения.Вставить("Текст",		ТелоПисьма.ПолучитьТекст());
	
	Справочники.Оповещения.СформироватьОповещения(
		Механизм,
		Перечисления.ТипыСобытий.ВнешнийВызов,
		РеквизитыОповещения);
		
КонецПроцедуры		

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	// Фиксация начала формирования отчета
	
	Механизм			= ЭтотОбъект.Метаданные().ПолноеИмя();
	ПараметрыСтатистики	= РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект);	
	Сессия				= РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(Механизм, ПараметрыСтатистики.Хранилище, ПараметрыСтатистики.Описание); 
	
	// Формирование отчета
	
	НепогашенныеЗадолженности = ЗапросНепогашенныхЗадолженностей();
	
	СформироватьОтчетПоЗадолженности(ДокументРезультат, НепогашенныеЗадолженности);
	
	// Фиксация завершения формирования отчета
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);	
	
КонецПроцедуры

Процедура ЗаполнитьИсключаемыеСчета() Экспорт
	
	ЭтотОбъект.ИсключаемыеСчета.Очистить();
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Организация) Тогда
		Возврат;
	КонецЕсли;
	
	ВсеИсключаемыеСчета = Новый Массив;
	ВсеИсключаемыеСчета.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_Стратегия_ПН"));		// НПФ Стратегия ПН
	ВсеИсключаемыеСчета.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_Стратегия_ВР"));		// НПФ Стратегия ВР АО
	ВсеИсключаемыеСчета.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_Стратегия_ПН_АО"));		// НПФ Стратегия ПН АО
	ВсеИсключаемыеСчета.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_Стратегия_ПН_РОПС"));	// НПФ Стратегия ПН РОПС АО
	ВсеИсключаемыеСчета.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_Стратегия_СВ"));		// НПФ Стратегия СВ АО
	ВсеИсключаемыеСчета.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("СчетДУ_МЕЧЕЛ_ФОНД"));			// НПФ МЕЧЕЛ-ФОНД ПН АО

	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|ГДЕ
		|	СчетаДоверительногоУправления.Ссылка В(&ВсеИсключаемыеСчета)");

	Запрос.УстановитьПараметр("ВсеИсключаемыеСчета", ВсеИсключаемыеСчета);
	
	ЭтотОбъект.ИсключаемыеСчета.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0));
	
КонецПроцедуры

Функция ЗапросНепогашенныхЗадолженностей()
	
	// Ищем непогашенные задолженности:
	// - cо сроком больше 1 рабочего дня от даты плановой оплаты сделки;
	// - за 10 рабочих дней до плановой оплаты задолженности по вознаграждению управляющего;
	// - cо сроком больше 3 рабочих дней от даты начисления прочих задолженностей.

	#Область Текст_запроса
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК Основание,
		|	ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности КАК ТипЗадолженности,
		|	ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности КАК ВидЗадолженности,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Организация КАК Организация,
		|	ЗадолженностиПоДенежнымСредствамОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Валюта КАК Валюта,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Контрагент КАК Контрагент,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Аванс КАК Аванс,
		|	ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток КАК СуммаОстаток,
		|	ЗадолженностиПоДенежнымСредствамОстатки.СуммаКупонаОстаток КАК СуммаКупонаОстаток
		|ПОМЕСТИТЬ _ЗадолженностиПоДенежнымСредствам
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(&ПериодВключаяГраницу, &Организация = Организация) КАК ЗадолженностиПоДенежнымСредствамОстатки
		|ГДЕ
		|	НЕ ЗадолженностиПоДенежнымСредствамОстатки.СчетДоверительногоУправления В (&ИсключаемыеСчета)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЗадолженностиПоДенежнымСредствам.Основание КАК Основание,
		|	_ЗадолженностиПоДенежнымСредствам.ТипЗадолженности КАК ТипЗадолженности,
		|	_ЗадолженностиПоДенежнымСредствам.ВидЗадолженности КАК ВидЗадолженности,
		|	_ЗадолженностиПоДенежнымСредствам.Организация КАК Организация,
		|	_ЗадолженностиПоДенежнымСредствам.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ЗадолженностиПоДенежнымСредствам.Валюта КАК Валюта,
		|	_ЗадолженностиПоДенежнымСредствам.Контрагент КАК Контрагент,
		|	_ЗадолженностиПоДенежнымСредствам.Аванс КАК Аванс,
		|	_ЗадолженностиПоДенежнымСредствам.СуммаОстаток КАК СуммаОстаток,
		|	_ЗадолженностиПоДенежнымСредствам.СуммаКупонаОстаток КАК СуммаКупонаОстаток,
		|	НАЧАЛОПЕРИОДА(МИНИМУМ(ЗадолженностиПоДенежнымСредствам.Период), ДЕНЬ) КАК ДатаНачисления
		|ПОМЕСТИТЬ _ДатыНачисленияЗадолженностей
		|ИЗ
		|	_ЗадолженностиПоДенежнымСредствам КАК _ЗадолженностиПоДенежнымСредствам
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоДенежнымСредствам
		|		ПО _ЗадолженностиПоДенежнымСредствам.Основание = ЗадолженностиПоДенежнымСредствам.Основание
		|			И _ЗадолженностиПоДенежнымСредствам.ТипЗадолженности = ЗадолженностиПоДенежнымСредствам.ТипЗадолженности
		|			И _ЗадолженностиПоДенежнымСредствам.ВидЗадолженности = ЗадолженностиПоДенежнымСредствам.ВидЗадолженности
		|			И _ЗадолженностиПоДенежнымСредствам.Организация = ЗадолженностиПоДенежнымСредствам.Организация
		|			И _ЗадолженностиПоДенежнымСредствам.СчетДоверительногоУправления = ЗадолженностиПоДенежнымСредствам.СчетДоверительногоУправления
		|			И _ЗадолженностиПоДенежнымСредствам.Валюта = ЗадолженностиПоДенежнымСредствам.Валюта
		|			И _ЗадолженностиПоДенежнымСредствам.Контрагент = ЗадолженностиПоДенежнымСредствам.Контрагент
		|			И _ЗадолженностиПоДенежнымСредствам.Аванс = ЗадолженностиПоДенежнымСредствам.Аванс
		|
		|СГРУППИРОВАТЬ ПО
		|	_ЗадолженностиПоДенежнымСредствам.Основание,
		|	_ЗадолженностиПоДенежнымСредствам.ТипЗадолженности,
		|	_ЗадолженностиПоДенежнымСредствам.ВидЗадолженности,
		|	_ЗадолженностиПоДенежнымСредствам.Организация,
		|	_ЗадолженностиПоДенежнымСредствам.СчетДоверительногоУправления,
		|	_ЗадолженностиПоДенежнымСредствам.Валюта,
		|	_ЗадолженностиПоДенежнымСредствам.Контрагент,
		|	_ЗадолженностиПоДенежнымСредствам.Аванс,
		|	_ЗадолженностиПоДенежнымСредствам.СуммаОстаток,
		|	_ЗадолженностиПоДенежнымСредствам.СуммаКупонаОстаток
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1000000
		|	ДниДоДатыОплаты.Дата КАК Дата,
		|	АВТОНОМЕРЗАПИСИ() КАК Номер
		|ПОМЕСТИТЬ _КалендарьРабочихДней
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДниДоДатыОплаты
		|ГДЕ
		|	ДниДоДатыОплаты.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|	И ДниДоДатыОплаты.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДниДоДатыОплаты.Дата
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПлановыеДатыОплат.Организация КАК Организация,
		|	ПлановыеДатыОплат.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ПлановыеДатыОплат.ВидЗадолженности КАК ВидЗадолженности,
		|	ПлановыеДатыОплат.Валюта КАК Валюта,
		|	ПлановыеДатыОплат.Основание КАК Основание,
		|	ПлановыеДатыОплат.ДатаОплаты КАК ДатаОплаты
		|ПОМЕСТИТЬ _ПлановыеДатыОплат
		|ИЗ
		|	РегистрСведений.ПлановыеДатыОплат.СрезПоследних(
		|			&Период,
		|			(Организация, СчетДоверительногоУправления, ВидЗадолженности, Валюта, Основание) В
		|				(ВЫБРАТЬ
		|					_ДатыНачисленияЗадолженностей.Организация,
		|					_ДатыНачисленияЗадолженностей.СчетДоверительногоУправления,
		|					_ДатыНачисленияЗадолженностей.ВидЗадолженности,
		|					_ДатыНачисленияЗадолженностей.Валюта,
		|					_ДатыНачисленияЗадолженностей.Основание
		|				ИЗ
		|					_ДатыНачисленияЗадолженностей
		|				ГДЕ
		|					_ДатыНачисленияЗадолженностей.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВознаграждениюУправляющего))) КАК ПлановыеДатыОплат
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДатыНачисленияЗадолженностей.Основание КАК Основание,
		|	_ДатыНачисленияЗадолженностей.ТипЗадолженности КАК ТипЗадолженности,
		|	_ДатыНачисленияЗадолженностей.ВидЗадолженности КАК ВидЗадолженности,
		|	_ДатыНачисленияЗадолженностей.Организация КАК Организация,
		|	_ДатыНачисленияЗадолженностей.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ДатыНачисленияЗадолженностей.Валюта КАК Валюта,
		|	_ДатыНачисленияЗадолженностей.Контрагент КАК Контрагент,
		|	_ДатыНачисленияЗадолженностей.Аванс КАК Аванс,
		|	_ДатыНачисленияЗадолженностей.СуммаОстаток КАК СуммаОстаток,
		|	_ДатыНачисленияЗадолженностей.СуммаКупонаОстаток КАК СуммаКупонаОстаток,
		|	_ДатыНачисленияЗадолженностей.ДатаНачисления КАК ДатаНачисления,
		|	УсловияСделок.ДатаОплаты КАК ПлановаяДатаОплаты,
		|	УсловияСделок.ЦеннаяБумага КАК ЦеннаяБумага
		|ПОМЕСТИТЬ _ПросроченныеЗадолженности
		|ИЗ
		|	_ДатыНачисленияЗадолженностей КАК _ДатыНачисленияЗадолженностей
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделок.СрезПоследних(
		|				&Период,
		|				(Организация, Сделка) В
		|					(ВЫБРАТЬ
		|						_ДатыНачисленияЗадолженностей.Организация,
		|						_ДатыНачисленияЗадолженностей.Основание
		|					ИЗ
		|						_ДатыНачисленияЗадолженностей
		|					ГДЕ
		|						_ДатыНачисленияЗадолженностей.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке))) КАК УсловияСделок
		|		ПО (УсловияСделок.Организация = _ДатыНачисленияЗадолженностей.Организация)
		|			И (УсловияСделок.Сделка = _ДатыНачисленияЗадолженностей.Основание)
		|ГДЕ
		|	_ДатыНачисленияЗадолженностей.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)
		|	И ТИПЗНАЧЕНИЯ(_ДатыНачисленияЗадолженностей.Основание) = ТИП(Документ.Сделка)
		|	И ЕСТЬNULL(УсловияСделок.ДатаОплаты <= &РабочихДнейНазад1, _ДатыНачисленияЗадолженностей.ДатаНачисления <= &РабочихДнейНазад3)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ДатыНачисленияЗадолженностей.Основание,
		|	_ДатыНачисленияЗадолженностей.ТипЗадолженности,
		|	_ДатыНачисленияЗадолженностей.ВидЗадолженности,
		|	_ДатыНачисленияЗадолженностей.Организация,
		|	_ДатыНачисленияЗадолженностей.СчетДоверительногоУправления,
		|	_ДатыНачисленияЗадолженностей.Валюта,
		|	_ДатыНачисленияЗадолженностей.Контрагент,
		|	_ДатыНачисленияЗадолженностей.Аванс,
		|	_ДатыНачисленияЗадолженностей.СуммаОстаток,
		|	_ДатыНачисленияЗадолженностей.СуммаКупонаОстаток,
		|	_ДатыНачисленияЗадолженностей.ДатаНачисления,
		|	ПлановыеДатыОплат.ДатаОплаты,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	_ДатыНачисленияЗадолженностей КАК _ДатыНачисленияЗадолженностей
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПлановыеДатыОплат КАК ПлановыеДатыОплат
		|		ПО (ПлановыеДатыОплат.Организация = _ДатыНачисленияЗадолженностей.Организация)
		|			И (ПлановыеДатыОплат.СчетДоверительногоУправления = _ДатыНачисленияЗадолженностей.СчетДоверительногоУправления)
		|			И (ПлановыеДатыОплат.ВидЗадолженности = _ДатыНачисленияЗадолженностей.ВидЗадолженности)
		|			И (ПлановыеДатыОплат.Валюта = _ДатыНачисленияЗадолженностей.Валюта)
		|			И (ПлановыеДатыОплат.Основание = _ДатыНачисленияЗадолженностей.Основание)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КалендарьРабочихДней КАК БлижайшийРабочийДеньПередОплатой
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				_ПлановыеДатыОплат.ДатаОплаты КАК ДатаОплаты,
		|				МАКСИМУМ(_КалендарьРабочихДней.Дата) КАК Дата
		|			ИЗ
		|				_ПлановыеДатыОплат КАК _ПлановыеДатыОплат
		|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ _КалендарьРабочихДней КАК _КалендарьРабочихДней
		|					ПО (_КалендарьРабочихДней.Дата < _ПлановыеДатыОплат.ДатаОплаты)
		|			
		|			СГРУППИРОВАТЬ ПО
		|				_ПлановыеДатыОплат.ДатаОплаты) КАК ДатыОплаты
		|			ПО (ДатыОплаты.Дата = БлижайшийРабочийДеньПередОплатой.Дата)
		|		ПО (ДатыОплаты.ДатаОплаты = ПлановыеДатыОплат.ДатаОплаты)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КалендарьРабочихДней КАК ДатыУведомления
		|		ПО (ДатыУведомления.Номер = БлижайшийРабочийДеньПередОплатой.Номер - &РабочихДнейПередОплатойВУК + 1)
		|ГДЕ
		|	_ДатыНачисленияЗадолженностей.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВознаграждениюУправляющего)
		|	И ЕСТЬNULL(ДатыУведомления.Дата <= &Период, ИСТИНА)
		|	И _ДатыНачисленияЗадолженностей.ДатаНачисления <= &РабочихДнейНазад3
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ДатыНачисленияЗадолженностей.Основание,
		|	_ДатыНачисленияЗадолженностей.ТипЗадолженности,
		|	_ДатыНачисленияЗадолженностей.ВидЗадолженности,
		|	_ДатыНачисленияЗадолженностей.Организация,
		|	_ДатыНачисленияЗадолженностей.СчетДоверительногоУправления,
		|	_ДатыНачисленияЗадолженностей.Валюта,
		|	_ДатыНачисленияЗадолженностей.Контрагент,
		|	_ДатыНачисленияЗадолженностей.Аванс,
		|	_ДатыНачисленияЗадолженностей.СуммаОстаток,
		|	_ДатыНачисленияЗадолженностей.СуммаКупонаОстаток,
		|	_ДатыНачисленияЗадолженностей.ДатаНачисления,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_ДатыНачисленияЗадолженностей.Основание) = ТИП(Документ.ПогашениеЦеннойБумаги)
		|			ТОГДА ВЫРАЗИТЬ(_ДатыНачисленияЗадолженностей.Основание КАК Документ.ПогашениеЦеннойБумаги).ЦеннаяБумага
		|		КОГДА ТИПЗНАЧЕНИЯ(_ДатыНачисленияЗадолженностей.Основание) = ТИП(Документ.ПогашениеКупона)
		|			ТОГДА ВЫРАЗИТЬ(_ДатыНачисленияЗадолженностей.Основание КАК Документ.ПогашениеКупона).Облигация
		|	КОНЕЦ
		|ИЗ
		|	_ДатыНачисленияЗадолженностей КАК _ДатыНачисленияЗадолженностей
		|ГДЕ
		|	НЕ(_ДатыНачисленияЗадолженностей.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделке)
		|				И ТИПЗНАЧЕНИЯ(_ДатыНачисленияЗадолженностей.Основание) = ТИП(Документ.Сделка))
		|	И НЕ _ДатыНачисленияЗадолженностей.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВознаграждениюУправляющего)
		|	И _ДатыНачисленияЗадолженностей.ДатаНачисления <= &РабочихДнейНазад3
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДефолтыПоОблигациям.Облигация КАК ЦеннаяБумага,
		|	МАКСИМУМ(ДефолтыПоОблигациям.ТипДефолта = ЗНАЧЕНИЕ(Перечисление.ТипыДефолтаПоОблигациям.Банкротство)) КАК Банкротство,
		|	МАКСИМУМ(ДефолтыПоОблигациям.ТипДефолта = ЗНАЧЕНИЕ(Перечисление.ТипыДефолтаПоОблигациям.КупонныеВыплаты)
		|			И ДефолтыПоОблигациям.СтатусДефолта = ЗНАЧЕНИЕ(Перечисление.СтатусыДефолтаПоОблигациям.Дефолт)) КАК ДефолтПоКупону,
		|	МАКСИМУМ(ДефолтыПоОблигациям.ТипДефолта = ЗНАЧЕНИЕ(Перечисление.ТипыДефолтаПоОблигациям.ТелоОблигации)
		|			И ДефолтыПоОблигациям.СтатусДефолта = ЗНАЧЕНИЕ(Перечисление.СтатусыДефолтаПоОблигациям.Дефолт)) КАК ДефолтПоТелу
		|ПОМЕСТИТЬ _Дефолты
		|ИЗ
		|	РегистрСведений.ДефолтыПоОблигациям.СрезПоследних(
		|			&Период,
		|			Облигация В
		|					(ВЫБРАТЬ
		|						_ПросроченныеЗадолженности.ЦеннаяБумага
		|					ИЗ
		|						_ПросроченныеЗадолженности КАК _ПросроченныеЗадолженности)
		|				И (ТипДефолта = ЗНАЧЕНИЕ(Перечисление.ТипыДефолтаПоОблигациям.Банкротство)
		|					ИЛИ ТипДефолта = ЗНАЧЕНИЕ(Перечисление.ТипыДефолтаПоОблигациям.ТелоОблигации)
		|					ИЛИ ТипДефолта = ЗНАЧЕНИЕ(Перечисление.ТипыДефолтаПоОблигациям.КупонныеВыплаты))) КАК ДефолтыПоОблигациям
		|
		|СГРУППИРОВАТЬ ПО
		|	ДефолтыПоОблигациям.Облигация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА _ПросроченныеЗадолженности.СуммаОстаток < 0
		|				ИЛИ _ПросроченныеЗадолженности.СуммаКупонаОстаток < 0
		|			ТОГДА ""Ошибки""
		|		КОГДА РАЗНОСТЬДАТ(_ПросроченныеЗадолженности.ДатаНачисления, &Период, ДЕНЬ) > 365
		|			ТОГДА ""БольшеГода""
		|		КОГДА _Дефолты.ЦеннаяБумага ЕСТЬ НЕ NULL 
		|			ТОГДА ""Дефолт""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Категория,
		|	ВЫБОР
		|		КОГДА _ПросроченныеЗадолженности.СуммаОстаток < 0
		|				ИЛИ _ПросроченныеЗадолженности.СуммаКупонаОстаток < 0
		|			ТОГДА ""Ошибки""
		|		КОГДА РАЗНОСТЬДАТ(_ПросроченныеЗадолженности.ДатаНачисления, &Период, ДЕНЬ) > 365
		|			ТОГДА ""Начисленные больше года назад задолженности""
		|		КОГДА _Дефолты.ЦеннаяБумага ЕСТЬ НЕ NULL 
		|			ТОГДА ""Задолженности по дефолтным бумагам""
		|		ИНАЧЕ ""Начисленные задолженности""
		|	КОНЕЦ КАК КатегорияПредставление,
		|	ВЫБОР
		|		КОГДА _ПросроченныеЗадолженности.СуммаОстаток < 0
		|				ИЛИ _ПросроченныеЗадолженности.СуммаКупонаОстаток < 0
		|			ТОГДА 0
		|		КОГДА РАЗНОСТЬДАТ(_ПросроченныеЗадолженности.ДатаНачисления, &Период, ДЕНЬ) > 365
		|			ТОГДА 3
		|		КОГДА _Дефолты.ЦеннаяБумага ЕСТЬ НЕ NULL 
		|			ТОГДА 2
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК КатегорияПорядок,
		|	РАЗНОСТЬДАТ(_ПросроченныеЗадолженности.ДатаНачисления, &Период, ДЕНЬ) > 365 КАК НачисленоБольшеГодаНазад,
		|	_Дефолты.ЦеннаяБумага ЕСТЬ НЕ NULL  КАК ДефолтПоБумаге,
		|	_ПросроченныеЗадолженности.ДатаНачисления КАК ДатаНачисления,
		|	_ПросроченныеЗадолженности.Организация КАК Организация,
		|	_ПросроченныеЗадолженности.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ПРЕДСТАВЛЕНИЕ(_ПросроченныеЗадолженности.СчетДоверительногоУправления) КАК СчетДоверительногоУправленияПредставление,
		|	_ПросроченныеЗадолженности.Основание КАК Основание,
		|	ПРЕДСТАВЛЕНИЕ(_ПросроченныеЗадолженности.Основание) КАК ОснованиеПредставление,
		|	_ПросроченныеЗадолженности.ТипЗадолженности КАК ТипЗадолженности,
		|	ВЫБОР
		|		КОГДА _ПросроченныеЗадолженности.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|			ТОГДА ""Дебиторская""
		|		ИНАЧЕ ""Кредиторская""
		|	КОНЕЦ КАК ТипЗадолженностиПредставление,
		|	_ПросроченныеЗадолженности.ВидЗадолженности КАК ВидЗадолженности,
		|	ПРЕДСТАВЛЕНИЕ(_ПросроченныеЗадолженности.ВидЗадолженности) КАК ВидЗадолженностиПредставление,
		|	_ПросроченныеЗадолженности.Валюта КАК Валюта,
		|	ПРЕДСТАВЛЕНИЕ(_ПросроченныеЗадолженности.Валюта) КАК ВалютаПредставление,
		|	_ПросроченныеЗадолженности.Контрагент КАК Контрагент,
		|	ПРЕДСТАВЛЕНИЕ(_ПросроченныеЗадолженности.Контрагент) КАК КонтрагентПредставление,
		|	_ПросроченныеЗадолженности.Аванс КАК Аванс,
		|	_ПросроченныеЗадолженности.СуммаОстаток КАК СуммаОстаток,
		|	_ПросроченныеЗадолженности.СуммаКупонаОстаток КАК СуммаКупонаОстаток,
		|	_ПросроченныеЗадолженности.СуммаОстаток + _ПросроченныеЗадолженности.СуммаКупонаОстаток КАК ИтогоСуммаОстаток,
		|	_ПросроченныеЗадолженности.ПлановаяДатаОплаты КАК ПлановаяДатаОплаты,
		|	_ПросроченныеЗадолженности.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ПРЕДСТАВЛЕНИЕ(_ПросроченныеЗадолженности.ЦеннаяБумага) КАК ЦеннаяБумагаПредставление
		|ИЗ
		|	_ПросроченныеЗадолженности КАК _ПросроченныеЗадолженности
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Дефолты КАК _Дефолты
		|		ПО (_Дефолты.ЦеннаяБумага = _ПросроченныеЗадолженности.ЦеннаяБумага)
		|			И (_Дефолты.Банкротство
		|				ИЛИ _Дефолты.ДефолтПоТелу
		|				ИЛИ _Дефолты.ДефолтПоКупону)
		|
		|УПОРЯДОЧИТЬ ПО
		|	КатегорияПорядок,
		|	ДатаНачисления УБЫВ,
		|	СчетДоверительногоУправления
		|ИТОГИ
		|	МАКСИМУМ(КатегорияПредставление),
		|	КОЛИЧЕСТВО(Основание)
		|ПО
		|	Категория
		|АВТОУПОРЯДОЧИВАНИЕ");
	
	КоличествоЗаписейВКалендаре = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ КОЛИЧЕСТВО(*) ИЗ РегистрСведений.ДанныеКалендаря");
	КоличествоЗаписейВКалендаре = КоличествоЗаписейВКалендаре.Выполнить().Выгрузить()[0][0];
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1000000", СтрШаблон("ПЕРВЫЕ %1", Формат(КоличествоЗаписейВКалендаре, "ЧН=; ЧГ=")));
	
	#КонецОбласти
	
	РабочихДнейНазад1 = Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, НачалоДня(ЭтотОбъект.Период) - 1, -1);
	РабочихДнейНазад3 = Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, НачалоДня(ЭтотОбъект.Период) - 1, -3);
	
	РабочихДнейПередПлановойОплатойВознаграждения = 10;
	
	Запрос.УстановитьПараметр("ПериодВключаяГраницу",	Новый Граница(ЭтотОбъект.Период, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Период",						ЭтотОбъект.Период);
	Запрос.УстановитьПараметр("РабочихДнейНазад1",			РабочихДнейНазад1);
	Запрос.УстановитьПараметр("РабочихДнейНазад3",			РабочихДнейНазад3);
	Запрос.УстановитьПараметр("РабочихДнейПередОплатойВУК",	РабочихДнейПередПлановойОплатойВознаграждения);
	Запрос.УстановитьПараметр("Организация",				ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ИсключаемыеСчета",			ЭтотОбъект.ИсключаемыеСчета);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ЗапросНесписанныхРезервовПодОбесценение()
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РезервыПредстоящихРасходовОстатки.СубъектАналитики КАК СубъектАналитики,
		|	РезервыПредстоящихРасходовОстатки.СуммаОстаток КАК Сумма,
		|	РезервыПредстоящихРасходовОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ИЗ
		|	РегистрНакопления.РезервыПредстоящихРасходов.Остатки(
		|			&ПериодВключаяГраницу,
		|			Организация = &Организация
		|				И СубъектАналитики <> НЕОПРЕДЕЛЕНО) КАК РезервыПредстоящихРасходовОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК СтоимостьАктивовнеОтносящихсяКЦеннымБумагам
		|		ПО (СтоимостьАктивовнеОтносящихсяКЦеннымБумагам.Период = &Период)
		|			И РезервыПредстоящихРасходовОстатки.Организация = СтоимостьАктивовнеОтносящихсяКЦеннымБумагам.Организация
		|			И РезервыПредстоящихРасходовОстатки.СчетДоверительногоУправления = СтоимостьАктивовнеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления
		|			И (СтоимостьАктивовнеОтносящихсяКЦеннымБумагам.Активность)
		|			И (ВЫБОР
		|				КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовнеОтносящихсяКЦеннымБумагам.Основание) = ТИП(Документ.СделкаРЕПО)
		|					ТОГДА СтоимостьАктивовнеОтносящихсяКЦеннымБумагам.Основание = РезервыПредстоящихРасходовОстатки.СубъектАналитики
		|							И СтоимостьАктивовнеОтносящихсяКЦеннымБумагам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВторойЧастиРЕПО)
		|				КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовнеОтносящихсяКЦеннымБумагам.Основание) В (ТИП(Документ.ПогашениеКупона), ТИП(Документ.НачислениеДивидендов))
		|					ТОГДА СтоимостьАктивовнеОтносящихсяКЦеннымБумагам.Основание = РезервыПредстоящихРасходовОстатки.СубъектАналитики
		|				КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовнеОтносящихсяКЦеннымБумагам.Основание) = ТИП(Документ.ПогашениеЦеннойБумаги)
		|						И СтоимостьАктивовнеОтносящихсяКЦеннымБумагам.ВидЗадолженности <> ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона)
		|					ТОГДА СтоимостьАктивовнеОтносящихсяКЦеннымБумагам.Основание = РезервыПредстоящихРасходовОстатки.СубъектАналитики
		|				КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовнеОтносящихсяКЦеннымБумагам.СубъектАналитики) = ТИП(Справочник.ДепозитныеВклады)
		|					ТОГДА СтоимостьАктивовнеОтносящихсяКЦеннымБумагам.СубъектАналитики = РезервыПредстоящихРасходовОстатки.СубъектАналитики
		|							И СтоимостьАктивовнеОтносящихсяКЦеннымБумагам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоДепозитномуВкладу)
		|				КОГДА ТИПЗНАЧЕНИЯ(СтоимостьАктивовнеОтносящихсяКЦеннымБумагам.СубъектАналитики) = ТИП(Справочник.БрокерскиеКомпании)
		|					ТОГДА СтоимостьАктивовнеОтносящихсяКЦеннымБумагам.СубъектАналитики = РезервыПредстоящихРасходовОстатки.СубъектАналитики
		|							И СтоимостьАктивовнеОтносящихсяКЦеннымБумагам.Валюта = РезервыПредстоящихРасходовОстатки.Валюта
		|				ИНАЧЕ СтоимостьАктивовнеОтносящихсяКЦеннымБумагам.СубъектАналитики = РезервыПредстоящихРасходовОстатки.СубъектАналитики
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
		|		ПО (ФинансовыеПоказатели.Период = &Период)
		|			И РезервыПредстоящихРасходовОстатки.Организация = ФинансовыеПоказатели.Организация
		|			И РезервыПредстоящихРасходовОстатки.СчетДоверительногоУправления = ФинансовыеПоказатели.СубъектАналитики
		|			И (ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок))
		|ГДЕ
		|	СтоимостьАктивовнеОтносящихсяКЦеннымБумагам.СубъектАналитики ЕСТЬ NULL
		|	И ФинансовыеПоказатели.Значение ЕСТЬ НЕ NULL ");
	
	Запрос.УстановитьПараметр("Период",					НачалоДня(ЭтотОбъект.Период));
	Запрос.УстановитьПараметр("ПериодВключаяГраницу",	Новый Граница(КонецДня(ЭтотОбъект.Период), ВидГраницы.Включая));	
	Запрос.УстановитьПараметр("Организация",			ЭтотОбъект.Организация);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Процедура СформироватьОтчетПоЗадолженности(ДокументРезультат, НепогашенныеЗадолженности)
	
	Макет = ПолучитьМакет("Макет");
	
	ВыборкаКатегории = НепогашенныеЗадолженности.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаКатегории.Следующий() Цикл
		
		// Заголовок таблицы
		
		ОбластьЗаголовокТаблицы = ПолучитьОбласть(Макет, "ЗаголовокТаблицы", ВыборкаКатегории.Категория);
		ОбластьЗаголовокТаблицы.Параметры.Поле = СтрШаблон(ВыборкаКатегории.КатегорияПредставление + " (%1)", ВыборкаКатегории.Основание);
				
		ДокументРезультат.Вывести(ОбластьЗаголовокТаблицы);		
		
		ДокументРезультат.НачатьГруппуСтрок();
		
		// Шапка таблицы
		
		ОбластьШапкаТаблицы = ПолучитьОбласть(Макет, "ШапкаТаблицы", ВыборкаКатегории.Категория);
		
		ДокументРезультат.Вывести(ОбластьШапкаТаблицы);		
		
		// Сведения о задолженностях
		
		ВыборкаЗадолженности = ВыборкаКатегории.Выбрать(ОбходРезультатаЗапроса.Прямой);
		
		Пока ВыборкаЗадолженности.Следующий() Цикл
			
			ВычисляемыеПараметры = Новый Структура("СрокЗадолженности, ДополнительныеСведения");
			
			Если Не ВыборкаЗадолженности.НачисленоБольшеГодаНазад Тогда
				РабочихДнейСМоментаНачисления			= Справочники.Календари.КоличествоРабочихДней(Справочники.Календари.Общероссийский, ВыборкаЗадолженности.ДатаНачисления, НачалоДня(ЭтотОбъект.Период) - 1);
				ВычисляемыеПараметры.СрокЗадолженности	= СтрокаСЧислом(";%1 раб. день;;%1 раб. дня;%1 раб. дней;%1 раб. дня", РабочихДнейСМоментаНачисления, ВидЧисловогоЗначения.Количественное, "L=ru");		
			КонецЕсли;	
			
			Если ВыборкаЗадолженности.Аванс Тогда
				ВычисляемыеПараметры.Вставить("ВидЗадолженностиПредставление", ВыборкаЗадолженности.ВидЗадолженностиПредставление + " (аванс)");
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ВыборкаЗадолженности.ЦеннаяБумага) Тогда
				ВычисляемыеПараметры.ДополнительныеСведения = ВыборкаЗадолженности.ЦеннаяБумага;
			ИначеЕсли ЗначениеЗаполнено(ВыборкаЗадолженности.Контрагент) Тогда
				ВычисляемыеПараметры.ДополнительныеСведения = ВыборкаЗадолженности.Контрагент;
			КонецЕсли;
			
			ОбластьСтрокаТаблицы = ПолучитьОбласть(Макет, "СтрокаТаблицы", ВыборкаКатегории.Категория);
			ОбластьСтрокаТаблицы.Параметры.Заполнить(ВыборкаЗадолженности);
			ОбластьСтрокаТаблицы.Параметры.Заполнить(ВычисляемыеПараметры);
			
			ДокументРезультат.Вывести(ОбластьСтрокаТаблицы);		
			
		КонецЦикла;
		
		ДокументРезультат.ЗакончитьГруппуСтрок();
		
		ДокументРезультат.Вывести(Макет.ПолучитьОбласть("РазделительТаблиц"));
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура СформироватьОтчетПоРезервам(ДокументРезультат, НесписанныеРезервы)
	
	Макет = ПолучитьМакет("Макет");
	
	// Заголовок таблицы		
	ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицыОшибки");
	ОбластьЗаголовокТаблицы.Параметры.Поле = "Несписанные суммы резервов под обесценение по активам, отсутствующим в СЧА";
	ДокументРезультат.Вывести(ОбластьЗаголовокТаблицы);	
	
	// Шапка таблицы		
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицыРезервы");	
	ДокументРезультат.Вывести(ОбластьШапкаТаблицы);		
	
	ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицыРезервы");
	
	Выборка = НесписанныеРезервы.Выбрать();
		
	Пока Выборка.Следующий() Цикл
				
		// Строки		
		ОбластьСтрокаТаблицы.Параметры.Заполнить(Выборка);
				
		ДокументРезультат.Вывести(ОбластьСтрокаТаблицы);		
		
	КонецЦикла;	
	
КонецПроцедуры


Функция ПолучитьОбласть(Макет, ИмяОбласти, Категория)
	
	Область = Макет.Области.Найти(ИмяОбласти + Категория);
	
	Возврат ?(Область = Неопределено, Макет.ПолучитьОбласть(ИмяОбласти), Макет.ПолучитьОбласть(ИмяОбласти + Категория));
	
КонецФункции
